class HadeethData {
  List<Map<String, String>> hadeethList = [
    {
      "hadeethNameInArabic": "الحديث الأول",
      "hadeethNameInEnglish": "Hadeeth 1",
      "hadeethContent":
          "عن ابن عباس -رضيَ الله عنهما- قال: (أتَتِ النَّبيَّ صلَّى اللهُ عليه وسلَّم امرأة فَقَالَتْ: إنِّي أُصْرَعُ، وإنِّي أتَكَشَّفُ، فَادْعُ اللَّهَ لِي، قَالَ: إنْ شِئْتِ صَبَرْتِ ولَكِ الجَنَّةُ، وإنْ شِئْتِ دَعَوْتُ اللَّهَ أنْ يُعَافِيَكِ، فَقَالَتْ: أصْبِرُ، فَقَالَتْ: إنِّي أتَكَشَّفُ، فَادْعُ اللَّهَ لي ألَّا أتَكَشَّفَ، فَدَعَا لَهَا).",
    },
    {
      "hadeethNameInArabic": "الحديث الثاني",
      "hadeethNameInEnglish": "Hadeeth 2",
      "hadeethContent":
          "قال الرّسول -صلّى الله عليه وسلّم- فيما رواه عن الله -تبارك وتعالى-: (إنَّ اللَّهَ تَبارَكَ وتَعالَى يقولُ لأهْلِ الجَنَّةِ: يا أهْلَ الجَنَّةِ، فيَقولونَ: لَبَّيْكَ رَبَّنا وسَعْدَيْكَ، فيَقولُ: هلْ رَضِيتُمْ؟ فيَقولونَ: وما لنا لا نَرْضَى وقدْ أعْطَيْتَنا ما لَمْ تُعْطِ أحَدًا مِن خَلْقِكَ؟ فيَقولُ: أنا أُعْطِيكُمْ أفْضَلَ مِن ذلكَ، قالوا: يا رَبِّ، وأَيُّ شَيءٍ أفْضَلُ مِن ذلكَ؟ فيَقولُ: أُحِلُّ علَيْكُم رِضْوانِي، فلا أسْخَطُ علَيْكُم بَعْدَهُ أبَدًا.",
    },
    {
      "hadeethNameInArabic": "الحديث الثالث",
      "hadeethNameInEnglish": "Hadeeth 3",
      "hadeethContent":
          "قال الرّسول -صلّى الله عليه وسلّم-: (يقولُ اللَّهُ عَزَّ وَجَلَّ: مَن جَاءَ بالحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَأَزِيدُ، وَمَن جَاءَ بالسَّيِّئَةِ فَجَزَاؤُهُ سَيِّئَةٌ مِثْلُهَا، أَوْ أَغْفِرُ وَمَن تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ منه ذِرَاعًا، وَمَن تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ منه بَاعًا، وَمَن أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً، وَمَن لَقِيَنِي بقُرَابِ الأرْضِ خَطِيئَةً لا يُشْرِكُ بي شيئًا لَقِيتُهُ بمِثْلِهَا مَغْفِرَةً).",
    },
    {
      "hadeethNameInArabic": "الحديث الرابع",
      "hadeethNameInEnglish": "Hadeeth 4",
      "hadeethContent":
          "قال الرّسول -صلّى الله عليه وسلّم-: (ما شيءٌ أثقلُ في ميزانِ المؤمِنِ يومَ القيامةِ مِن خُلُقٍ حسَنٍ، فإنَّ اللَّهَ تعالى ليُبغِضُ الفاحشَ البَذيءَ).",
    },
    {
      "hadeethNameInArabic": "الحديث الخامس",
      "hadeethNameInEnglish": "Hadeeth 5",
      "hadeethContent":
          "قال الرّسول -صلّى الله عليه وسلّم-: (من كانتِ الآخرةُ هَمَّهُ جعلَ اللَّهُ غناهُ في قلبِهِ وجمعَ لَه شملَهُ وأتتهُ الدُّنيا وَهيَ راغمة، ومن كانتِ الدُّنيا همَّهُ جعلَ اللَّهُ فقرَهُ بينَ عينيهِ وفرَّقَ عليهِ شملَهُ، ولم يأتِهِ منَ الدُّنيا إلَّا ما قُدِّرَ لَهُ).",
    },
  ];
}
